hans-jorg/stm32f746g/X30-Ethernet/eth.c
    return 0;
}


/**
 * @brief  ETH_ReadPHYRegister
 */
static int ETH_ReadPHYRegister( uint32_t reg, uint32_t *val) {
uint32_t macmiiar = ETH->MACMIIAR;

    // Clear all fields except CR
    macmiiar &= ~ETH_MACMIIAR_CR_Msk;

    // Set PHY address
    macmiiar |= (ETH_PHY_ADDRESS<<ETH_MACMIIAR_PA_Pos);

    // Set PHY register
    macmiiar |= ((reg)<<ETH_MACMIIAR_MR_Pos);

    // Set write operation
    macmiiar |= ETH_MACMIIAR_MW;

    // Wait until PHY is ready
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) != 0 ) {}    // TODO: Add timeout

    // Set busy flag
    macmiiar |= ETH_MACMIIAR_MB;

    // Start read operation
    ETH->MACMIIAR = macmiiar;

    // Test if it runs ok
    delay(10);
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB ) {}  // TODO: Add timeout

    // Read value
    *val = ETH->MACMIIDR;

    return 0;
}

/**
 * @brief  Configure PHY
 *
 * @note   PHY is Microchip LAN
 */

static int ETH_ConfigurePHY(void) {
uint32_t value;
int retries;
int configured = 0;

    ETH_WritePHYRegister(ETH_PHY_BCR,ETH_PHY_BCR_RESET);
    delay(ETH_DELAY_AFTERRESET);

    // Configure speed and connection
    ETH_UpdateConfig();

    /*
     * This code sequence is identical to the one generated by
     * STM32CubeMX.
     * 
     * Since nINT not connected, PHY can not generate interrupts.
     * According LAN8742A datasheet, change of ISFR does not make sense,
     * because its fields are Read-Only.
     * 
     * But this register is vendor-specific. Maybe it does not work
     * following the datasheet.
     */
    // Enable interrupt on link status 
    ETH_ReadPHYRegister(ETH_PHY_ISFR,&value);
    value |= ETH_PHY_ISFR_INT4;
    ETH_WritePHYRegister(ETH_PHY_ISFR,value);
    // Read again to clear
    ETH_ReadPHYRegister(ETH_PHY_ISFR,&value);

    return 0;


}


/**
 * @brief  Table used to set CR clock range to select MDC clock frequency
 *
 * @note   See description of CR field of MACMIIAR register in section 38.8.1 in RM.
 *
 * @note   The order is important. The index is used to configure field!!!
 */
struct {
    uint32_t    minfreq;
    uint32_t    maxfreq;

} static cr_tab[] = {
    {   60000000,       100000000   },      // CR=000
    {  100000000,       150000000   },      // CR=001
    {   20000000,        35000000   },      // CR=010
    {   35000000,        60000000   },      // CR=011
    {  150000000,       216000000   },      // CR=100
    {          0,               0   }
};

/**
 * @brief  Find CR encoding
 */
static uint32_t findCREncoding(void) {
uint32_t hclkfreq;
int cr;

    hclkfreq = SystemGetHCLKFrequency();
    cr = 0;
    while( cr_tab[cr].minfreq
        && ( (hclkfreq < cr_tab[cr].minfreq)
            || (hclkfreq > cr_tab[cr].maxfreq)
           )
         ) {
        cr++;
    }
    return cr<<ETH_MACMIIAR_CR_Pos;

}

/**
 * @brief   ETH ConfigureMAC
 *
 * @note    Configuring Media Access Control of the ETH Controller 
 * 
 * @note    MAC Registers
 * 
 *          * MACR: configuration register
 *          * MACFFR: frame filter register
 *          * MACHTHR: hash table high register
 *          * MACHTLR: hash table low register
 *          * MACMIIAR: MII (Media Independent Interface) address register
 *          * MACMIIDR: MII (Media Independent Interface) data register
 *          * MACFCR: flow control register
 *          * MACVLANTR: VLAN tag register
 *          * MACRWUFFR: remote wakeup frame filter register
 *          * MACPMRCSR: PMT (Power Management) control and status register
 *          * MACDBGR: debug register
 *          * MACSR: interrupt status register
 *          * MACIMR: interrupt mask register
 *          * MACA0HR: address 0 high register
 *          * MACA0LR: address 0 low register
 *          * MACA1HR: address 1 high register
 *          * MACA1LR: address 1 low register
 *          * MACA2HR: address 2 high register
 *          * MACA2LR: address 2 low register
 *          * MACA3HR: address 3 high register
 *          * MACA3LR: address 3 low register
 
 * 
 * @note    Configuration generated by STM32CubeMX
 * 
 *          * Watchdog enabled
 *          * Jabber enabled
 *          * Interframe gap set to 96
 *          * Carriersense enabled
 *          * Receive own enable
 *          * Loopback disabled
 *          * Checksum done by hardware
 *          * Retry transmission disabled
 *          * Automatic PAD CRC strip disabled
 *          * Backoff limit set to 10
 *          * Deferral check disabled
 *          * Receive all disabled
 *          * Source address filter disabled
 *          * Block all control frames
 *          * Broadcastframes reception_enabled
 *          * Destination filter normal
 *          * Promiscuous mode disabled
 *          * Multicast frames perfect
 *          * Unicast frames filter perfect
 *          * Zero quanta pause disabled
 *          * Pause low threshold set to -4
 *          * Unicast pause frame detect disabled
 *          * Receive flow control disabled
 *          * Transmit flow control disabled
 *
 */

static int ETH_ConfigureMAC(void) {

    /*************** MACCR: MAC Configuration Register ************************/

    uint32_t maccr = ETH->MACCR;

    // Clear all fields
    maccr &= 0;

    // Configure
    // There are many fields with negative logic (1 to disable, 0 to enable)
    // No CRC stripping
    // Watchdog enable. Receive at most 2048 bytes
    // Jabber enable. Transmit at most 2048 bytes
    // Carrier sense active and generate error/abort transmission
    // Fast Ethernet will be set accordingly later
    // Receive own frames enabled!!!
    // No Loopback
    // Duplex mode will be set accordingly later
    // IPv4 checksum offload (ETH controller calculates CRC)
    // Retry enabled (based on BL)
    // No automatic pad/CRC stripping
    // Back-off limit = 10
    // No deferral check
    // Receiver and transmitter disabled, for now
    maccr |=     0
                |ETH_MACCR_IPCO         // Checksum by hardware
                |ETH_MACCR_IFG_96Bit    // Interframe gap = 96
                |ETH_MACCR_RD           // Retry disable = 1
                |ETH_MACCR_BL_10        // Backoff limit = min(n,4)
                ;

                

