hans-jorg/stm32f746g/X30-Ethernet/eth.c
    return 0;
}


/**
 * @brief ETH ETH_InitTXDescriptors
 *
 * @note  desc must be an array of DMA Descriptor
 *
 * @note  area must be count*ETH_TXBUFFER_SIZE
 *
 * @note  desc and area must be static!!!
 */

void ETH_InitTXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_TXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->Status    = ETH_TXDESC_CHAINED | ETH_TXDESC_CIC;
        desc->ControlBufferSize = 0;
        desc->Buffer1Addr = (uint32_t) (a + i*ETH_TXBUFFERSIZE_INT32UNITS);
        desc->Buffer2NextDescAddr = (uint32_t) (desc+((i+1)%count));
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMATDLAR = (uint32_t) desc;

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    buffers_initialized |= TXBUFFER_INITIALIZED;
#endif

    ETH_TXDescToBeUsed = desc;

}

/**
 * @brief ETH ETH_InitRXDescriptors
 *
 * @note  desc must be an array of DMA Descriptor
 *
 * @note  area must be count*ETH_TXBUFFER_SIZE
 *
 * @note  desc and area must be static!!!
 */


void ETH_InitRXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_RXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->Status    = ETH_RXDESC_OWN;
        desc->ControlBufferSize = ETH_RXBUFFER_SIZE | ETH_RXDESC_CHAINED;
        desc->Buffer1Addr =  (uint32_t) (a + i*ETH_RXBUFFERSIZE_INT32UNITS);
        desc->Buffer2NextDescAddr =  (uint32_t) (desc + ((i+1)%count));
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMARDLAR = (uint32_t) desc;

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    buffers_initialized |= RXBUFFER_INITIALIZED;
#endif

    ETH_RXDescToBeUsed = desc;
}

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
/**
 * @brief ETH InitializeBuffers
 *
 * @note  Initialize all descriptors to point to buffers insided area
 *
 * @note  area must be aligned to a word address.]
 *
 * @note  area must have a size equal or largert to (ETH_TXBUFFER_COUNT*ETH_TXBUFFER_SIZE
 *   +ETH_RXBUFFER_COUNT*ETH_TXBUFFER_SIZE) bytes, with ETH_TXBUFFER_SIZE and ETH_RXBUFFER_SIZE
 *   multiple of sizeof(uint32_t)_
 */

void ETH_InitializeBuffers(char *area) {
uint32_t *a = (uint32_t *) area;

    ETH_InitTXDescriptors(ETH_TXDesc,ETH_TXBUFFER_COUNT,(uint8_t *) a);
    a += ETH_TXBUFFERSIZE_INT32UNITS *ETH_TXBUFFER_COUNT;
    ETH_InitRXDescriptors(ETH_RXDesc,ETH_RXBUFFER_COUNT,(uint8_t *) a);

}
#endif

/**
 * @brief   ConfigureMediaInterface
 * 
 * @note    This configuration must be done while the MAC is under reset and
 *          before enabling the MAC clocks. Since this is done using SYSCFG
 *          controller, its clock must be enabled first.
 */
static void ConfigureMediaInterface(void) {
uint32_t media = 1; // RMII PHY Interface

    // Enable SYSCFG clock to select the ethernet PHY interface to be used
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
    __NOP();
    __NOP();
    __DSB();

    //  Select RMII mode
    SYSCFG->PMC = (SYSCFG->PMC&~(SYSCFG_PMC_MII_RMII_SEL))
                 |(media<<SYSCFG_PMC_MII_RMII_SEL_Pos);
}

/**
 * @brief   ETH_Init
 *
 * @note    Initialize ETH controller
 * 
 * @note    When using dynamically allocated buffers, the must be
 *          registered before calling this function
 * 
 * @note    Initialization steps:
 * 
 *        * Setup buffers
 *        * Configure pins for ETH usage
 *        * Configure clocks
 *        * Reset ETH interface
 *        * Configure clock for serial communication
 *        * Configure PHY
 *        * Configure MAC
 *        * Configure DMA
 */

void ETH_Init(void) {

    // Reset callbacks
    ETH_Callbacks.ErrorDetected    = 0;
    ETH_Callbacks.FrameReceived    = 0;
    ETH_Callbacks.FrameTransmitted = 0;
    ETH_Callbacks.LinkStatusChanged= 0;


#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    if( buffers_initialized != (RXBUFFER_INITIALIZED|TXBUFFER_INITIALIZED ) {
        while(1) {}
    }
#else
    ETH_InitTXDescriptors(ETH_TXDesc,ETH_TXBUFFER_COUNT,txbuffer);
    ETH_InitRXDescriptors(ETH_RXDesc,ETH_RXBUFFER_COUNT,rxbuffer);
#endif

    // Enable clocks for ETH
    ETH_EnableClock(ETH_CLOCK_MAC|ETH_CLOCK_MACRX|ETH_CLOCK_MACTX);

    // Configure pins
    ConfigureETHPins();

    // Configure Media Interface
    ConfigureMediaInterface();

    // Reset ETH system
    ETH->DMABMR |= ETH_DMABMR_SR;
    // Wait until reset                     
    // TODO: Add timeout
    while( (ETH->DMABMR&ETH_DMABMR_SR) != 0 ) {
        delay(100);
    }

    // Configuring MDC CLock
    uint32_t cr = findCREncoding();
    ETH->MACMIIAR = (ETH->MACMIIAR&~ETH_MACMIIAR_CR_Msk)|cr;

    // Configuring PHY
    ETH_ConfigurePHY();

    // Clear the MAC configuration
    ETH_ConfigureMAC();

    // Configure DMA
    ETH_ConfigureDMA();

    // Configuring interrupt
    ETH->DMAIER |= (ETH_DMAIER_NISE|ETH_DMAIER_RIE);

#ifdef ETH_USE_ETH_IRQ
    NVIC_SetPriority(ETH_IRQn,ETH_IRQLevel);
    NVIC_EnableIRQ(ETH_IRQn);
#endif

}


/**
 * @brief   ETH Start
 *
 * @note    ETH_Init must be successfully called before
 */

void ETH_Start(void) {

    // Enable transmission
    ETH_EnableTransmissionMAC();

    // Start reception
    ETH_EnableReceptionMAC();

    // Flush FIFO
    ETH_FlushTXFIFO();

    // Enable transmission DMA
    ETH_EnableTransmissionDMA();

    // Enable reception DMA
    ETH_EnableReceptionDMA();

}

/**
 * @brief   ETH Stop
 */

void ETH_Stop(void) {

    // Disable reception DMA
    ETH_DisableReceptionDMA();

    // Disable transmission DMA
    ETH_DisableTransmissionDMA();

    // Flush FIFO
    ETH_FlushTXFIFO();

    // Stop transmission
    ETH_DisableTransmissionDMA();

    // Stop reception
    ETH_DisableReceptionDMA();
}

/**
 * @brief   Update configuration
 * 
 * @note    To be used when reconnecting
 * 
 * @returns 0 when link not up
 *          1  when configured by autonegotiation
 *          2  when configured manually
 * 
 * @note    ETH_Status is set according the speed and duplex mode 
 */
int
ETH_UpdateConfig(void) {
int configured = 0;
int retries = 0;
uint32_t value;

    ETH_Status = 0;
    if( ETH_Config&ETH_CONFIG_AUTONEGOTIATE ) {
        // Autonegotiate set
        retries = ETH_RETRIES_LINK;
        do {
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            delay(ETH_DELAY_BETWEENTESTS);
            retries--;
        } while ((retries>0)&&(value&ETH_PHY_BSR_LINKUP)!=ETH_PHY_BSR_LINKUP);
        if( (value&ETH_PHY_BSR_LINKUP) != ETH_PHY_BSR_LINKUP ) {
            return 0;
        }

        // Configure Autonegotiate
        ETH_WritePHYRegister(ETH_PHY_BCR,ETH_PHY_BCR_AUTONEGOTIATION);
        delay(ETH_DELAY_AFTERAUTONEGOTIATION);
        retries = ETH_RETRIES_AUTONEGOTIATION;
        do {
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            delay(ETH_DELAY_BETWEENTESTS);
        } while(    (retries>0)
                 &&( (value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED)
                   !=ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED) );

        if( (value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED)==ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED ) {
            // Get the result
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            // Set status
            if( value&(ETH_PHY_BSR_100BASET_FULLDUPLEX|ETH_PHY_BSR_10BASET_FULLDUPLEX) ) {
                ETH_Status |= ETH_CONFIG_FULLDUPLEX;
            } else {
                ETH_Status |= ETH_CONFIG_HALFDUPLEX;
            }
            if( value&(ETH_PHY_BSR_100BASET_FULLDUPLEX|ETH_PHY_BSR_100BASET_HALFDUPLEX) ) {
                ETH_Status |= ETH_CONFIG_100BASET;
            } else {
                ETH_Status |= ETH_CONFIG_10BASET;
            }
            configured = 1;
        }
    }
    if( ! configured ) {
        // Autonegotiation not set or not working
        // Configure Speed and Duplex Mode
        value = 0;
        if( ETH_Config&ETH_CONFIG_FULLDUPLEX ) {
            if ( ETH_Config&ETH_CONFIG_100BASET )  {
                value |= ETH_PHY_BSR_100BASET_FULLDUPLEX;
                ETH_Status |= ETH_CONFIG_100BASET|ETH_CONFIG_FULLDUPLEX;
            } else if ( ETH_Config&ETH_CONFIG_10BASET ) {
                value |= ETH_PHY_BSR_10BASET_FULLDUPLEX;
                ETH_Status |= ETH_CONFIG_10BASET|ETH_CONFIG_FULLDUPLEX;
            }
        } else if( ETH_Config&ETH_CONFIG_HALFDUPLEX ) {
            if ( ETH_Config&ETH_CONFIG_100BASET )  {
                value |= ETH_PHY_BSR_100BASET_HALFDUPLEX;
                ETH_Status |= ETH_CONFIG_100BASET|ETH_CONFIG_HALFDUPLEX;
            } else if ( ETH_Config&ETH_CONFIG_10BASET ) {
                value |= ETH_PHY_BSR_10BASET_HALFDUPLEX;
                ETH_Status |= ETH_CONFIG_10BASET|ETH_CONFIG_HALFDUPLEX;
            }
        }
        // Write config
        ETH_WritePHYRegister(ETH_PHY_BCR,value);
        delay(ETH_DELAY_AFTERCONFIG);

