hans-jorg/stm32f746g/X30-Ethernet/eth.c
        configured = 2;
    }

    // Post configuration actions

    return configured;
}
/**
 * @brief   Transmit data in buffer (maximal ETH_TXBUFFER_SIZE*ETH_MAX_PACKET_SIZE)
 *
 * @note    size must be smaller or equal to ETH_TXBUFFER_SIZE*ETH_MAX_PACKET_SIZE
 *
 * @note    Buffer can only be modified when there is no tx operation running
 *
 * @note    Procedure to transmit a multiple buffer frame
 *
 *          1. Setup the descriptors.
 *          2. Set OWN bit in all
 *          3. Set ST bit in DMAOMR register to start the DMA transmit engine
 *          4. Repeat
 *          5.    Copy data to transmission device (send it!)
 *          6.    If not the last one, get next descriptor
 *          7. Until all data is transmitted (No more descriptors with OWN bit set) or
 *             a descriptor has the LS bit set.
 *
 * @note    To resume operation, write something to DMATPDR
 *
 */
int
ETH_TransmitFrame(unsigned size) {
int nbuffers,lastbuffersize;
ETH_DMADescriptor *desc;

    if( size == 0 )
        return 0;

    desc = ETH_TXDescToBeUsed;
    // Check OWN bit in the first descriptor
    if( (desc->Status&ETH_TXDESC_OWN) == 0 ) {
        return -1;      // BUSY!!!!!!
    }

    nbuffers = size/ETH_TXBUFFER_SIZE;
    lastbuffersize = size%ETH_TXBUFFER_SIZE;
    if( lastbuffersize != 0 ) nbuffers++;

    if( nbuffers == 1 ) {
        // Configure first and only descriptor
        desc->Status |= ETH_TXDESC_FIRST|ETH_TXDESC_LAST;
        desc->ControlBufferSize = lastbuffersize&ETH_TXDESC_BUFFER1SIZE_MSK;
        desc->Status |= ETH_TXDESC_OWN;
    } else {
        // Configure first descriptor
        desc->Status = (desc->Status&~ETH_TXDESC_LAST)|ETH_TXDESC_FIRST;
        desc->ControlBufferSize = ETH_TXBUFFER_SIZE&ETH_TXDESC_BUFFER1SIZE_MSK;
        desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
        desc->Status |= ETH_TXDESC_OWN;

        // Configure intermediate descriptors
        for(int i=1;i<nbuffers-1;i++) {
            desc->Status  &= ~(ETH_TXDESC_FIRST|ETH_TXDESC_LAST);
            desc->ControlBufferSize = ETH_TXBUFFER_SIZE&ETH_TXDESC_BUFFER1SIZE_MSK;
            desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
            desc->Status |= ETH_TXDESC_OWN;
        }
        // Configure last descriptor
        desc->Status = (desc->Status&~ETH_TXDESC_FIRST)|ETH_TXDESC_LAST;
        desc->ControlBufferSize = lastbuffersize&ETH_TXDESC_BUFFER1SIZE_MSK;
        desc->Status |= ETH_TXDESC_OWN;
    }

    // Check Transmit buffer status
    if( ETH->DMASR&ETH_DMASR_TBUS ) {
        // Clear it and start transmission
        ETH->DMASR = ETH_DMASR_TBUS;        //
        ETH->DMATPDR = 0;                   // Resume transmission
    }

    ETH_TXDescToBeUsed = (ETH_DMADescriptor *) desc->Buffer1Addr;
    return 0;
}



/**
 * @brief   Receive data
 *
 * @note    Check if there is data in buffers and sets an indicator
 *
 * @note    Procedure to receive a multiple buffer frame
 *
 *       1.  Setup receive descriptors
 *       2.  Set OWN bit
 *       3.  Set bit SR in DMAOMR register to start the DMA receive engine
 *       4.  Repeat
 *             Receive data and store it into the buffer pointed by descriptor
 *             Write the first word (+0 offset) with OWN bit cleared and flags set
 *       5.  Until the last segment is received or the descriptor list does not have
 *           descriptors for the DMA engine, i.e,with OWN bit set.
 *
 * @note    To resume operation or force the scan of the descriptor list, a value 
 *          must be written to the DMA
 *
 * @note    All buffers will use the maximum size, except the last one. One must 
 *          get the FL field to get the size of the data in the last buffer.
 */

int
ETH_ReceiveFrame(ETH_DMAFrameInfo *RxFrameInfo) {
int len;
int bsize;
ETH_DMADescriptor *desc;

    // Clean RxFrameInfo
    RxFrameInfo->SegmentCount = 0;
    RxFrameInfo->FirstSegmentDesc = 0;
    RxFrameInfo->LastSegmentDesc = 0;
    RxFrameInfo->FrameLength = 0;

    // Scan descriptors
    desc = ETH_RXDescToBeUsed;
    while( (desc->Status&ETH_RXDESC_OWN) == 0 )  {
        len = (desc->Status&ETH_RXDESC_FIELDLENGTH_MASK)>>ETH_RXDESC_FIELDLENGTH_POS;
        bsize = (desc->ControlBufferSize&ETH_RXDESC_BUFFER1SIZE_MASK)>>ETH_RXDESC_BUFFER1SIZE_POS;
        if( (desc->Status&ETH_RXDESC_FIRST) && (desc->Status&ETH_RXDESC_LAST) ) {
            // Only one buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = 0;
            RxFrameInfo->SegmentCount = 1;
            len = (desc->Status&ETH_RXDESC_FIELDLENGTH_MASK)>>ETH_RXDESC_FIELDLENGTH_POS;
            RxFrameInfo->FrameLength = (len-4);      // exclude CRC
            return 1;
        } else if ( desc->Status&ETH_RXDESC_FIRST ) {
            // first buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = 0;
            RxFrameInfo->SegmentCount = 1;
            RxFrameInfo->FrameLength = bsize;
        } else if ( desc->Status&ETH_RXDESC_LAST )  {
            // last buffer
            RxFrameInfo->LastSegmentDesc  = desc;
            RxFrameInfo->SegmentCount++;
            RxFrameInfo->FrameLength += (len-4);     // exclude CRC
            return 1;
        } else {
            // intermediary
            RxFrameInfo->SegmentCount++;
            RxFrameInfo->FrameLength += bsize;
        }

        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        // Test if it returned to the start
        if( desc == ETH_RXDescToBeUsed )
            break;
    }
    ETH_RXDescToBeUsed = (ETH_DMADescriptor *) desc->Buffer1Addr;
    return 0;
}


/**
 * @brief   Check if a frame has been received
 *
 * @note    Specially the last buffer must have been received
 *
 */
int
ETH_CheckReception(void) {
ETH_DMADescriptor *desc;
uint32_t SegmentCount = 0;

    desc = ETH_RXDescToBeUsed;

    while(desc) {
        if( (desc->Status&ETH_RXDESC_OWN) != 0 )  {
            return 0;
        }

        if( (desc->Status&ETH_RXDESC_FIRST) && (desc->Status&ETH_RXDESC_LAST) ) {
            // Only one buffer
            SegmentCount = 1;
            return 1;
        } else if( desc->Status&ETH_RXDESC_FIRST ) {
            // First buffer
            SegmentCount = 1;
        } else if ( desc->Status&ETH_RXDESC_LAST ) {
            // Last buffer
            SegmentCount++;
            return 1;
        } else {
            // Middle buffer
            SegmentCount++;
        }
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        // Test if it returned to the start
        if( desc == ETH_RXDescToBeUsed )
            break;
    }
    return 0;
}



/**
 * @brief   Flush TX FIFO
 *
 */
static void
ETH_FlushTXFIFO(void) {

    ETH->DMAOMR = ETH_DMAOMR_FTF;

    delay(ETH_DELAY_AFTERFLUSH);

    return;
}


/**
 * @brief   ETH Enable/Disable Transmission DMA
 */
///@{
void ETH_EnableTransmissionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_ST;
}

void ETH_DisableTransmissionDMA(void) {

    ETH->DMAOMR &= ~ETH_DMAOMR_ST;
}
///@}


/**
 * @brief   ETH Enable/Disable Reception DMA
 */
///@{
void ETH_EnableReceptionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_SR;
}

void ETH_DisableReceptionDMA(void) {

